[Killed] ObjectLiteral
src/main/components/OurTable.js:6:14
 
 export default function OurTable({ columns, data, testid = "testid" }) {
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
-    useTable({ columns, data }, useSortBy);
+    useTable({}, useSortBy);
 
   return (
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/main/components/OurTable.js:11:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead>
-        {headerGroups.map((headerGroup, i) => (
-          <tr
-            {...headerGroup.getHeaderGroupProps()}
-            data-testid={`${testid}-header-group-${i}`}
-            // Stryker disable next-line StringLiteral : React key property not exposed in dom
-            key={`${testid}-header-group-${i}`}
-          >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                data-testid={`${testid}-header-${column.id}`}
-                // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                key={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()}>
killedBy: RestaurantTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
src/main/components/OurTable.js:14:26
         {headerGroups.map((headerGroup, i) => (
           <tr
             {...headerGroup.getHeaderGroupProps()}
-            data-testid={`${testid}-header-group-${i}`}
+            data-testid={``}
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: Error: Unable to find an element by: [data-testid="testid-header-group-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
src/main/components/OurTable.js:18:38
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
           >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                data-testid={`${testid}-header-${column.id}`}
-                // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                key={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
src/main/components/OurTable.js:27:78
               >
                 {column.render("Header")}
                 <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
+                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : """Stryker was here!"
                 </span>
               </th>
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Error: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!

[Killed] StringLiteral
src/main/components/OurTable.js:37:29
       <tbody {...getTableBodyProps()}>
         {rows.map((row) => {
           prepareRow(row);
-          const rowTestId = `${testid}-row-${row.index}`;
+          const rowTestId = ``;
           return (
             <tr
killedBy: OurTable tests renders a table with three rows with correct test ids
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testid-row-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
src/main/components/OurTable.js:45:48
               // Stryker disable next-line StringLiteral : React key property not exposed in dom
               key={rowTestId}
             >
-              {row.cells.map((cell, _index) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    {...cell.getCellProps()}
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}
-                  >
-                    {cell.render("Cell")}
-                  </td>
-                );
-              })}
+              {row.cells.map((cell, _index) => {})}
             </tr>
           );
killedBy: OurTable tests The button appears in the table
statusReason: Error: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
src/main/components/OurTable.js:91:64
 //   ButtonColumn("Delete", "danger", deleteCallback)
 // ];
 
-export function ButtonColumn(label, variant, callback, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  };
-  return column;
-}
+export function ButtonColumn(label, variant, callback, testid) {}
 
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
src/main/components/OurTable.js:95:11
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
+    Cell: () => undefined,
   };
   return column;
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
