[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:28:41
         <Form.Group className="mb-3">
           <Form.Label htmlFor="id">Id</Form.Label>
           <Form.Control
-            data-testid={testIdPrefix + "-id"}
+            data-testid={testIdPrefix + ""}
             id="id"
             type="text"
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:45:24
           id="name"
           type="text"
           isInvalid={Boolean(errors.name)}
-          {...register("name", {
+          {...register("", {
             required: "Name is required.",
             maxLength: {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantForm.js:47:24
           isInvalid={Boolean(errors.name)}
           {...register("name", {
             required: "Name is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:49:24
             required: "Name is required.",
             maxLength: {
               value: 30,
-              message: "Max length 30 characters",
+              message: "",
             },
           })}
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Restaurants/RestaurantForm.js:65:39
           id="description"
           type="text"
           isInvalid={Boolean(errors.description)}
-          {...register("description", {
-            required: "Description is required.",
-          })}
+          {...register("description", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Description is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:66:23
           type="text"
           isInvalid={Boolean(errors.description)}
           {...register("description", {
-            required: "Description is required.",
+            required: "",
           })}
         />
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Description is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Restaurants/RestaurantForm.js:74:57
         </Form.Control.Feedback>
       </Form.Group>
 
-      <Button type="submit" data-testid={testIdPrefix + "-submit"}>
+      <Button type="submit" data-testid={testIdPrefix + ""}>
         {buttonLabel}
       </Button>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
