[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:15:18
 export default function RestaurantTable({
   restaurants,
   currentUser,
-  testIdPrefix = "RestaurantTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/restaurants/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/restaurants/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:48:15
       accessor: "name",
     },
     {
-      Header: "Description",
+      Header: "",
       accessor: "description",
     },
killedBy: RestaurantTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
