[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDateForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDateForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDateForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.js:58:28
               id="quarterYYYYQ"
               type="text"
               isInvalid={Boolean(errors.quarterYYYYQ)}
-              {...register("quarterYYYYQ", {
+              {...register("", {
                 required: true,
                 pattern: yyyyq_regex,
killedBy: UCSBDateForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.js:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
+              {errors.quarterYYYYQ || "QuarterYYYYQ is required. "}
               {errors.quarterYYYYQ?.type === "pattern" &&
                 "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.js:65:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
-              {errors.quarterYYYYQ?.type === "pattern" &&
-                "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.js:66:17
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
               {errors.quarterYYYYQ?.type === "pattern" &&
-                "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /QuarterYYYYQ must be in the format YYYYQ/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDateForm.js:78:45
               id="localDateTime"
               type="datetime-local"
               isInvalid={Boolean(errors.localDateTime)}
-              {...register("localDateTime", {
-                required: true,
-                pattern: isodate_regex,
-              })}
+              {...register("localDateTime", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBDates/UCSBDateForm.js:78:28
               id="localDateTime"
               type="datetime-local"
               isInvalid={Boolean(errors.localDateTime)}
-              {...register("localDateTime", {
+              {...register("", {
                 required: true,
                 pattern: isodate_regex,
killedBy: UCSBDateForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/UCSBDates/UCSBDateForm.js:84:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.localDateTime && "LocalDateTime is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /LocalDateTime is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
