[Killed] BlockStatement
main/components/UCSBDates/UCSBDatesTable.js:15:34
 export default function UCSBDatesTable({ dates, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdates/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdates/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.js:34:5
   };
 
   const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
+    {},
     {
       Header: "QuarterYYYYQ",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.js:35:15
 
   const columns = [
     {
-      Header: "id",
+      Header: "",
       accessor: "id", // accessor is the "key" in the data
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/UCSBDates/UCSBDatesTable.js:38:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "QuarterYYYYQ",
-      accessor: "quarterYYYYQ",
-    },
+    {},
     {
       Header: "Name",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.js:39:15
       accessor: "id", // accessor is the "key" in the data
     },
     {
-      Header: "QuarterYYYYQ",
+      Header: "",
       accessor: "quarterYYYYQ",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: QuarterYYYYQ. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.js:47:15
       accessor: "name",
     },
     {
-      Header: "Date",
+      Header: "",
       accessor: "localDateTime",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.js:48:17
     },
     {
       Header: "Date",
-      accessor: "localDateTime",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-localDateTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBDates/UCSBDatesTable.js:57:56
       ButtonColumn("Edit", "primary", editCallback, "UCSBDatesTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBDatesTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDatesTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
