[Killed] StringLiteral
main/components/Users/UsersTable.js:6:15
 const columns = [
   {
     Header: "id",
-    accessor: "id", // accessor is the "key" in the data
+    accessor: "", // accessor is the "key" in the data
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.js:18:15
   },
   {
     Header: "Email",
-    accessor: "email",
+    accessor: "",
   },
   {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.js:23:15
   {
     Header: "Admin",
     id: "admin",
-    accessor: (row, _rowIndex) => String(row.admin), // hack needed for boolean values to show up
+    accessor: () => undefined, // hack needed for boolean values to show up
   },
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
