[Killed] StringLiteral
src/main/pages/AdminUsersPage.js:13:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users"],
-    { method: "GET", url: "/api/admin/users" },
+    { method: "", url: "/api/admin/users" },
     [],
   );
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/admin/users"
Received string:    "Error communicating with backend via  on /api/admin/users"
