[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:10:7
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
 
-  if (!currentUser.loggedIn) {
+  if (false) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] StringLiteral
src/main/pages/ProfilePage.js:28:28
         <Col md>
           <h2>{fullName}</h2>
           <p className="lead text-muted">{email}</p>
-          <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
+          <RoleBadge role={""} currentUser={currentUser} />
           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
           <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ProfilePage.js:29:28
           <h2>{fullName}</h2>
           <p className="lead text-muted">{email}</p>
           <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
-          <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
+          <RoleBadge role={""} currentUser={currentUser} />
           <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
         </Col>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-member"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
