[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantCreatePage.js:8:48
 import { toast } from "react-toastify";
 
 export default function RestaurantCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (restaurant) => ({
-    url: "/api/restaurants/post",
-    method: "POST",
-    params: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
-  });
+  const objectToAxiosParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:9:10
 
 export default function RestaurantCreatePage({ storybook = false }) {
   const objectToAxiosParams = (restaurant) => ({
-    url: "/api/restaurants/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
