[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:34:11
     params: {
       id: restaurant.id,
     },
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    },
+    data: {},
   });
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"Freebirds World Burrito\",\"description\":\"Totally Giant Burritos\"}"
Received: "{}"

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
-        {restaurant && (
-          <RestaurantForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={restaurant}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
