[Killed] StringLiteral
main/pages/UCSBDates/UCSBDatesCreatePage.js:9:10
 
 export default function UCSBDatesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (ucsbDate) => ({
-    url: "/api/ucsbdates/post",
+    url: "",
     method: "POST",
     params: {
killedBy: UCSBDatesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbDate Created - id: 17 name: Groundhog Day"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
