[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesEditPage.js:58:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbdates" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDatesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdates"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {ucsbDate && (
-          <UCSBDateForm
-            initialContents={ucsbDate}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDatesEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
