[Killed] BlockStatement
src/main/utils/currentUser.js:5:34
 import axios from "axios";
 import { useNavigate } from "react-router-dom";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery(
-    "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _currentUser.useCurrentUser)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/currentUser.js:9:17
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery(
     "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-      }
-    },
+    async () => {},
     {
       initialData: { loggedIn: false, root: null, initialData: true },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/currentUser.js:19:19
         }
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-      }
+      } catch (e) {}
     },
     {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/currentUser.js:23:5
         console.error("Error invoking axios.get: ", e);
       }
     },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
+    {},
   );
 }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "loggedIn": false, "root": null}
Received: undefined

[Killed] BooleanLiteral
src/main/utils/currentUser.js:24:64
       }
     },
     {
-      initialData: { loggedIn: false, root: null, initialData: true },
+      initialData: { loggedIn: false, root: null, initialData: false },
     },
   );
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "initialData": true,
+   "initialData": false,

[Killed] BooleanLiteral
src/main/utils/currentUser.js:24:32
       }
     },
     {
-      initialData: { loggedIn: false, root: null, initialData: true },
+      initialData: { loggedIn: true, root: null, initialData: true },
     },
   );
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
src/main/utils/currentUser.js:29:29
   );
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
-  });
-  return mutation;
-}
+export function useLogout() {}
 
 export function hasRole(currentUser, role) {
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/main/utils/currentUser.js:32:44
 export function useLogout() {
   const queryClient = useQueryClient();
   const navigate = useNavigate();
-  const mutation = useMutation(async () => {
-    await axios.post("/logout");
-    await queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
-  });
+  const mutation = useMutation(async () => {});
   return mutation;
 }
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/main/utils/currentUser.js:35:14
   const mutation = useMutation(async () => {
     await axios.post("/logout");
     await queryClient.resetQueries("current user", { exact: true });
-    navigate("/");
+    navigate("");
   });
   return mutation;
killedBy: utils/currentUser tests useLogout tests useLogout
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/currentUser.js:40:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate
-  // data level, or not?
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  if (currentUser.data?.root?.rolesList) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
 
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/main/utils/currentUser.js:47:7
 
   // We will file an issue to track that down and then remove this hack
 
-  if (currentUser == null) return false;
+  if (false) return false;
 
   if (currentUser.data?.root?.rolesList) {
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] OptionalChaining
src/main/utils/currentUser.js:49:7
 
   if (currentUser == null) return false;
 
-  if (currentUser.data?.root?.rolesList) {
+  if (currentUser.data?.root.rolesList) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of null (reading 'rolesList')

[Killed] ConditionalExpression
src/main/utils/currentUser.js:49:7
 
   if (currentUser == null) return false;
 
-  if (currentUser.data?.root?.rolesList) {
+  if (true) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of null (reading 'rolesList')
