[Killed] BlockStatement
src/main/utils/systemInfo.js:4:33
 import { useQuery } from "react-query";
 import axios from "axios";
 
-export function useSystemInfo() {
-  return useQuery(
-    "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
-    {
-      initialData: {
-        initialData: true,
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      },
-    },
-  );
-}
+export function useSystemInfo() {}
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _systemInfo.useSystemInfo)(...)' as it is undefined.

[Killed] BlockStatement
src/main/utils/systemInfo.js:7:17
 export function useSystemInfo() {
   return useQuery(
     "systemInfo",
-    async () => {
-      try {
-        const response = await axios.get("/api/systemInfo");
-        return response.data;
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        return {};
-      }
-    },
+    async () => {},
     {
       initialData: {
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/systemInfo.js:16:5
         return {};
       }
     },
-    {
-      initialData: {
-        initialData: true,
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      },
-    },
+    {},
   );
 }
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"initialData": true, "showSwaggerUILink": false, "springH2ConsoleEnabled": false}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/systemInfo.js:17:20
       }
     },
     {
-      initialData: {
-        initialData: true,
-        springH2ConsoleEnabled: false,
-        showSwaggerUILink: false,
-      },
+      initialData: {},
     },
   );
killedBy: utils/systemInfo tests useSystemInfo tests useSystemInfo retrieves initial data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "initialData": true,
-   "showSwaggerUILink": false,
