[Killed] BlockStatement
src/main/utils/useBackend.js:28:68
 //     []
 // );
 
-export function useBackend(queryKey, axiosParameters, initialData) {
-  return useQuery(
-    queryKey,
-    async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        toast(errorMessage);
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    {
-      initialData,
-    },
-  );
-}
+export function useBackend(queryKey, axiosParameters, initialData) {}
 
 // const wrappedParams = async (params) =>
killedBy: RestaurantEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _useBackend.useBackend)(...)' as it is undefined.

[Timeout] BlockStatement
src/main/utils/useBackend.js:31:17
 export function useBackend(queryKey, axiosParameters, initialData) {
   return useQuery(
     queryKey,
-    async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        toast(errorMessage);
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
+    async () => {},
     {
       initialData,

[Killed] BlockStatement
src/main/utils/useBackend.js:32:11
   return useQuery(
     queryKey,
     async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
+      try {} catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
         toast(errorMessage);
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/utils/useBackend.js:42:5
         throw e;
       }
     },
-    {
-      initialData,
-    },
+    {},
   );
 }
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["initialData"]
Received: undefined

[Killed] BlockStatement
src/main/utils/useBackend.js:57:41
   return null;
 };
 
-const wrappedParams = async (params) => {
-  try {
-    return await (
-      await axios(params)
-    ).data;
-  } catch (rejectedValue) {
-    reportAxiosError(rejectedValue);
-    throw rejectedValue;
-  }
-};
+const wrappedParams = async (params) => {};
 
 export function useBackendMutation(
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate with id 1 was deleted"
Received: undefined

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/useBackend.js:58:7
 };
 
 const wrappedParams = async (params) => {
-  try {
-    return await (
-      await axios(params)
-    ).data;
-  } catch (rejectedValue) {
+  try {} catch (rejectedValue) {
     reportAxiosError(rejectedValue);
     throw rejectedValue;
killedBy: UCSBDatesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDate with id 1 was deleted"
Received: undefined

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/useBackend.js:62:27
     return await (
       await axios(params)
     ).data;
-  } catch (rejectedValue) {
-    reportAxiosError(rejectedValue);
-    throw rejectedValue;
-  }
+  } catch (rejectedValue) {}
 };
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] BlockStatement
src/main/utils/useBackend.js:72:3
   objectToAxiosParams,
   useMutationParams,
   queryKey = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) queryClient.invalidateQueries(queryKey);
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'mutate')

[Killed] BlockStatement
src/main/utils/useBackend.js:76:24
   const queryClient = useQueryClient();
 
   return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-    onError: (data) => {
-      toast(`${data}`);
-    },
+    onError: (data) => {},
     // Stryker disable all: Not sure how to set up the complex behavior needed to test this
     onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1
